# Chapter 2 Selection and Assignment

## Basic selection from a Series

### How to do it

In [4]:
import pandas as pd
import numpy as np

In [5]:
ser = pd.Series(list("abc") * 3)
ser

0    a
1    b
2    c
3    a
4    b
5    c
6    a
7    b
8    c
dtype: object

In [6]:
# find the value of label 3
ser[3]

'a'

In [7]:
# get a pd.Series returned
ser[[3]]

3    a
dtype: object

In [8]:
# select multiple values
ser[[0, 2]]

0    a
2    c
dtype: object

In [9]:
# use slice (assuming the default index is used)
ser[:3]

0    a
1    b
2    c
dtype: object

In [10]:
# negative slice index
ser[-4:]

5    c
6    a
7    b
8    c
dtype: object

In [11]:
# provide start and stop arguments
ser[2:6]

2    c
3    a
4    b
5    c
dtype: object

In [12]:
# provide start, stop and tep arguments
ser[1:8:3]

1    b
4    b
7    b
dtype: object

In [13]:
ser = pd.Series(range(3), index=["Jack", "Jill", "Jayne"])
ser

Jack     0
Jill     1
Jayne    2
dtype: int64

In [14]:
# return the corresponding element
ser["Jill"]

1

In [15]:
# return a pd.Series
ser[["Jill"]]

Jill    1
dtype: int64

### There's more...

In [17]:
# use integers as index, but different from auto-incrementing sequence that starts at 0
ser = pd.Series(list("abc"), index=[2, 42, 21])
ser

2     a
42    b
21    c
dtype: object

In [18]:
# select by label, not by position
ser[2]

'a'

In [19]:
# slicing still works positionally
ser[:2]

2     a
42    b
dtype: object

In [20]:
# non-unique pd.Index
ser = pd.Series(["apple", "banana", "orange"], index=[0, 1, 1])
ser

0     apple
1    banana
1    orange
dtype: object

In [21]:
# select the index 1
ser[1]

1    banana
1    orange
dtype: object

## Basic selection from a DataFrame

### How to do it

In [24]:
df = pd.DataFrame(np.arange(9).reshape(3, -1), columns=["a", "b", "c"])
df

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [25]:
# select a single column
df["a"]

0    0
1    3
2    6
Name: a, dtype: int64

In [26]:
# return a pd.DataFrame
df[["a"]]

   a
0  0
1  3
2  6

In [27]:
# select multiple columns
df[["a", "b"]]

   a  b
0  0  1
1  3  4
2  6  7

In [28]:
# using slice will select from rows
df[:2]

   a  b  c
0  0  1  2
1  3  4  5

### There's more...

In [30]:
# the order of columns will match
df[["a", "b"]]

   a  b
0  0  1
1  3  4
2  6  7

In [31]:
df[["b", "a"]]

   b  a
0  1  0
1  4  3
2  7  6

## Position-based selection of a Series

### How to do it

In [34]:
# create a pd.Series with non-unique integeral labels
ser = pd.Series(["apple", "banana", "orange"], index=[0, 1, 1])
ser

0     apple
1    banana
1    orange
dtype: object

In [35]:
# select a scalar
ser.iloc[1]

'banana'

In [36]:
# return a pd.Series
ser.iloc[[1]]

1    banana
dtype: object

In [37]:
# select multiple elements
ser.iloc[[0, 2]]

0     apple
1    orange
dtype: object

In [38]:
# using slice
ser.iloc[:2]

0     apple
1    banana
dtype: object

## Position-based selection of a DataFrame

### How to do it

In [41]:
df = pd.DataFrame(np.arange(20).reshape(5, -1), columns=list("abcd"))
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [42]:
# specify iloc[row, column] to return a scalar
df.iloc[2, 2]

10

In [43]:
# an empty slice return everything from that axis
df.iloc[:, 0]

0     0
1     4
2     8
3    12
4    16
Name: a, dtype: int64

In [44]:
# select only the first row
df.iloc[0, :]

a    0
b    1
c    2
d    3
Name: 0, dtype: int64

In [45]:
# return a pd.DataFrame
df.iloc[:, [0]]

    a
0   0
1   4
2   8
3  12
4  16

In [46]:
df.iloc[[0], :]

   a  b  c  d
0  0  1  2  3

In [47]:
# get the first and second rows paired with the last and second-to-last columns
df.iloc[[0, 1], [-1, -2]]

   d  c
0  3  2
1  7  6

### There's more...

In [49]:
# empty slices will return a copy of the object
ser.iloc[:]

0     apple
1    banana
1    orange
dtype: object

In [50]:
df.iloc[:, :]

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

## Label-based selection from a Series

### How to do it

In [53]:
ser = pd.Series(["apple", "banana", "orange"], index=[0, 1, 1])
ser

0     apple
1    banana
1    orange
dtype: object

In [54]:
# select all rows with label 1
ser.loc[1]

1    banana
1    orange
dtype: object

In [55]:
ser = pd.Series([2, 2, 4], index=["dog", "cat", "human"], name="num_legs")
ser

dog      2
cat      2
human    4
Name: num_legs, dtype: int64

In [56]:
ser.loc["dog"]

2

In [57]:
ser.loc[["dog", "cat"]]

dog    2
cat    2
Name: num_legs, dtype: int64

In [58]:
# select all rows up to and including the label "cat"
ser.loc[:"cat"]

dog    2
cat    2
Name: num_legs, dtype: int64

### There's more...

In [60]:
values = ["Jack", "Jill", "Jayne"]
ser = pd.Series(values)
ser

0     Jack
1     Jill
2    Jayne
dtype: object

In [61]:
# slicing returns values up to but not including the provided position
values[:2]

['Jack', 'Jill']

In [62]:
# slicing with pd.Series.iloc matches this behavior
ser.iloc[:2]

0    Jack
1    Jill
dtype: object

In [63]:
# slicing with pd.Series.loc actually produces a different result
ser.loc[:2]

0     Jack
1     Jill
2    Jayne
dtype: object

In [64]:
repeats_2 = pd.Series(range(5), index=[0, 1, 2, 2, 0])
repeats_2.loc[:2]

0    0
1    1
2    2
2    3
dtype: int64

In [65]:
# asking pandas to loop over the pd.Series until the labe "xxx" is found in the row index,
# continuing until a new label is found
ser = pd.Series(range(4), index=["zzz", "xxx", "xxx", "yyy"])
ser.loc[:"xxx"]

zzz    0
xxx    1
xxx    2
dtype: int64

In [66]:
# if the index labels have no determinate ordering, pandas will end up raising an error
# ser = pd.Series(range(4), index=["zzz", "xxx", "yyy", "xxx"])
# ser.loc[:"xxx"]

## Label-based selection from a DataFrame

### How to do it

In [69]:
df = pd.DataFrame([
    [24, 180, "blue"],
    [42, 166, "brown"],
    [22, 160, "green"],
], columns=["age", "height_cm", "eye_color"], index=["Jack", "Jill", "Jayne"])
df

       age  height_cm eye_color
Jack    24        180      blue
Jill    42        166     brown
Jayne   22        160     green

In [70]:
df.loc["Jayne", "eye_color"]

'green'

In [71]:
# select all rows from the "age" column
df.loc[:, "age"]

Jack     24
Jill     42
Jayne    22
Name: age, dtype: int64

In [72]:
# select all columns from the "Jack" row
df.loc["Jack", :]

age            24
height_cm     180
eye_color    blue
Name: Jack, dtype: object

In [73]:
# select the "age" column, maintaining the pd.DataFrame shape
df.loc[:, ["age"]]

       age
Jack    24
Jill    42
Jayne   22

In [74]:
# select both rows and columns using lists of labels
df.loc[["Jack", "Jill"], ["age", "eye_color"]]

      age eye_color
Jack   24      blue
Jill   42     brown

## Mixing position-based and label-based selection

### How to do it

In [77]:
# create a pd.DataFrame using the default auto-numbered pd.RangeIndex in the rows 
# but has custom string labels for the columns
df = pd.DataFrame([
    [24, 180, "blue"],
    [42, 166, "brown"],
    [22, 160, "green"],
], columns=["age", "height_cm", "eye_color"])
df

   age  height_cm eye_color
0   24        180      blue
1   42        166     brown
2   22        160     green

In [78]:
# convert a label of list of labels into their corresponding positions in a pd.Index
col_idxer = df.columns.get_indexer(["age", "eye_color"])
col_idxer

array([0, 2])

In [79]:
# use the above result as an argument to .iloc, 
# ensuring that you use position-based selection across both the rows and columns
df.iloc[[0, 1], col_idxer]

   age eye_color
0   24      blue
1   42     brown

### There's more...

In [81]:
# split the expression into a few steps
df[["age", "eye_color"]].iloc[[0, 1]]

   age eye_color
0   24      blue
1   42     brown

In [82]:
import timeit

In [83]:
def get_indexer_approach():
    col_idxer = df.columns.get_indexer(["age", "eye_color"])
    df.iloc[[0, 1], col_idxer]

timeit.timeit(get_indexer_approach, number=10_000)

0.8532172919949517

In [84]:
two_step_approach = lambda: df[["age", "eye_color"]].iloc[0, 1]
timeit.timeit(two_step_approach, number=10_000)

0.7990180409979075

## DataFrame.filter

### How to do it

In [87]:
df = pd.DataFrame([
    [24, 180, "blue"],
    [42, 166, "brown"],
    [22, 160, "green"],
], columns=[
    "age",
    "height_cm",
    "eye_color"
], index=["Jack", "Jill", "Jayne"])
df

       age  height_cm eye_color
Jack    24        180      blue
Jill    42        166     brown
Jayne   22        160     green

In [88]:
# similar to pd.DataFrame[]
df.filter(["age", "eye_color"])

       age eye_color
Jack    24      blue
Jill    42     brown
Jayne   22     green

In [89]:
# select rows instead of columns, pass axis=0
df.filter(["Jack", "Jill"], axis=0)

      age  height_cm eye_color
Jack   24        180      blue
Jill   42        166     brown

In [90]:
# select any row labels that start with "Ja" but do not end with "e"
df.filter(regex=r"^Ja.*(?<!e)$", axis=0)

      age  height_cm eye_color
Jack   24        180      blue

## Selection by data type

### How to do it

In [93]:
df = pd.DataFrame([
    [0, 1.0, "2"],
    [4, 8.0, "16"],
], columns=["int_col", "float_col", "string_col"])
df

   int_col  float_col string_col
0        0        1.0          2
1        4        8.0         16

In [94]:
# select only integral columns
df.select_dtypes("int")

   int_col
0        0
1        4

In [95]:
# select multiple types
df.select_dtypes(include=["int", "float"])

   int_col  float_col
0        0        1.0
1        4        8.0

In [96]:
# exclude some types
df.select_dtypes(exclude=["int", "float"])

  string_col
0          2
1         16

## Selection / filtering via Boolean arrays

### How to do it

In [99]:
mask = [True, False, True]
ser = pd.Series(range(3))
ser

0    0
1    1
2    2
dtype: int64

In [100]:
# use the mask as an argument to pd.Series[] will return each row where the corresponding mask entry is True
ser[mask]

0    0
2    2
dtype: int64

In [101]:
# pd.Series.loc will match the exact same behavior as pd.Series[] in this particular case
ser.loc[mask]

0    0
2    2
dtype: int64

In [102]:
# df[mask] will actually match along the rows rather than the columns
df = pd.DataFrame(np.arange(6).reshape(3, -1))
df[mask]

   0  1
0  0  1
2  4  5

In [103]:
# mask the columns alongside the rows
col_mask = [True, False]
df.loc[mask, col_mask]

   0
0  0
2  4

### There's more...

In [105]:
df = pd.DataFrame([
    [24, 180, "blue"],
    [42, 166, "brown"],
    [22, 160, "green"],
], columns=["age", "height_cm", "eye_color"], index=["Jack", "Jill", "Jayne"])
df

       age  height_cm eye_color
Jack    24        180      blue
Jill    42        166     brown
Jayne   22        160     green

In [106]:
# filter this only to users with blue or green eyes
blue_eyes = df["eye_color"] == "blue"
blue_eyes

Jack      True
Jill     False
Jayne    False
Name: eye_color, dtype: bool

In [107]:
green_eyes = df["eye_color"] == "green"
green_eyes

Jack     False
Jill     False
Jayne     True
Name: eye_color, dtype: bool

In [108]:
# combine those together into one Boolean mask using the OR operator: |
mask = blue_eyes | green_eyes
mask

Jack      True
Jill     False
Jayne     True
Name: eye_color, dtype: bool

In [109]:
df[mask]

       age  height_cm eye_color
Jack    24        180      blue
Jayne   22        160     green

In [110]:
# use AND operator: &
age_lt40 = df["age"] < 40
age_lt40

Jack      True
Jill     False
Jayne     True
Name: age, dtype: bool

In [111]:
height_gt70 = df["height_cm"] > 170
height_gt70

Jack      True
Jill     False
Jayne    False
Name: height_cm, dtype: bool

In [112]:
# ANDed together
df[age_lt40 & height_gt70]

      age  height_cm eye_color
Jack   24        180      blue

In [113]:
# INVERT operator
df[~(age_lt40 & height_gt70)]

       age  height_cm eye_color
Jill    42        166     brown
Jayne   22        160     green

## Selection with a MultiIndex - A single level

### How to do it

In [116]:
index = pd.MultiIndex.from_tuples([
    ("John", "Smith"),
    ("John", "Doe"),
    ("Jane", "Doe"),
    ("Stephen", "Smith"),
], names=["first_name", "last_name"])
ser = pd.Series(range(4), index=index)
ser

first_name  last_name
John        Smith        0
            Doe          1
Jane        Doe          2
Stephen     Smith        3
dtype: int64

In [117]:
# the output will not include this first level in its result
ser.loc["John"]

last_name
Smith    0
Doe      1
dtype: int64

In [118]:
# prevent this implicit level reduction from occuring
ser.loc[["John"]]

first_name  last_name
John        Smith        0
            Doe          1
dtype: int64

## Selection with a MultiIndex - Multiple levels

### How to do it

In [121]:
index = pd.MultiIndex.from_tuples([
    ("John", "Smith"),
    ("John", "Doe"),
    ("Jane", "Doe"),
    ("Stephen", "Smith"),
], names=["first_name", "last_name"])
ser = pd.Series(range(4), index=index)
ser

first_name  last_name
John        Smith        0
            Doe          1
Jane        Doe          2
Stephen     Smith        3
dtype: int64

In [122]:
# select all records where the first index level uses the label "Jane"
# and the second uses "Doe"
ser.loc[("Jane", "Doe")]

2

In [123]:
# maintain the pd.MultiIndex shape
ser.loc[(["Jane"], "Doe")]

first_name  last_name
Jane        Doe          2
dtype: int64

In [124]:
# select multiple records
ser.loc[[("John", "Smith"), ("Jane", "Doe")]]

first_name  last_name
John        Smith        0
Jane        Doe          2
dtype: int64

In [125]:
# select all recods where the second index level is "Doe" (drops the second index level)
ser.loc[(slice(None), "Doe")]

first_name
John    1
Jane    2
dtype: int64

In [126]:
# maintain the pd.MultiIndex shape
ser.loc[(slice(None), ["Doe"])]

first_name  last_name
John        Doe          1
Jane        Doe          2
dtype: int64

In [127]:
alist = list("abc")
alist[:]

['a', 'b', 'c']

In [128]:
# the same with above
alist[slice(None)]

['a', 'b', 'c']

### There's more...

In [130]:
ser.loc[(slice(None), ["Doe"])]

first_name  last_name
John        Doe          1
Jane        Doe          2
dtype: int64

In [131]:
# the same as above
ixsl = pd.IndexSlice
ser.loc[ixsl[:, ["Doe"]]]

first_name  last_name
John        Doe          1
Jane        Doe          2
dtype: int64

## Selection with a MultiIndex - a DataFrame

### How to do it

In [134]:
row_index = pd.MultiIndex.from_tuples([
    ("John", "Smith"),
    ("John", "Doe"),
    ("Jane", "Doe"),
    ("Stephen", "Smith"),
], names=["first_name", "last_name"])

col_index = pd.MultiIndex.from_tuples([
    ("music", "favorite"),
    ("music", "last_seen_live"),
    ("art", "favorite"),
], names=["art_type", "category"])

df = pd.DataFrame([
    ["Swift", "Swift", "Matisse"],
    ["Mozart", "T. Swift", "Van Gogh"],
    ["Beatles", "Wonder", "Warhol"],
    ["Jackson", "Dylan", "Picasso"],
], index=row_index, columns=col_index)
df

art_type                music                      art
category             favorite last_seen_live  favorite
first_name last_name
John       Smith        Swift          Swift   Matisse
           Doe         Mozart       T. Swift  Van Gogh
Jane       Doe        Beatles         Wonder    Warhol
Stephen    Smith      Jackson          Dylan   Picasso

In [135]:
# select all rows where the second level is "Smith"
# and all columns where the second level is "favorite"
row_idxer = (slice(None), "Smith")
col_idxer = (slice(None), "favorite")
df.loc[row_idxer, col_idxer]

art_type                music      art
category             favorite favorite
first_name last_name
John       Smith        Swift  Matisse
Stephen    Smith      Jackson  Picasso

In [136]:
# the same as above
df.loc[(slice(None), "Smith"), (slice(None), "favorite")]

art_type                music      art
category             favorite favorite
first_name last_name
John       Smith        Swift  Matisse
Stephen    Smith      Jackson  Picasso

## Item assignment with .loc and .iloc

### How to do it

In [139]:
ser = pd.Series(range(3), index=list("abc"))
ser

a    0
b    1
c    2
dtype: int64

In [140]:
# assign a value by matching against the label of an index
ser.loc["b"] = 42
ser

a     0
b    42
c     2
dtype: int64

In [141]:
# assign a value positionally
ser.iloc[2] = -42
ser

a     0
b    42
c   -42
dtype: int64

## DataFrame column assignment

### How to do it

In [144]:
df = pd.DataFrame({"col1": [1, 2, 3]})
df

   col1
0     1
1     2
2     3

In [145]:
# assign new column, take a scalar value and broadcast it to every row
df["new_column1"] = 42
df

   col1  new_column1
0     1           42
1     2           42
2     3           42

In [146]:
# assign a pd.Series or sequence as long as the number of elements 
# matches the number of rows in the pd.DataFrame
df["new_column2"] = list("abc")
df

   col1  new_column1 new_column2
0     1           42           a
1     2           42           b
2     3           42           c

In [147]:
df["new_column3"] = pd.Series(["dog", "cat", "human"])
df

   col1  new_column1 new_column2 new_column3
0     1           42           a         dog
1     2           42           b         cat
2     3           42           c       human

In [148]:
# if the number does not match, the assignment will fail
# df["should_fail"] = ["too few", "rows"]

In [149]:
row_index = pd.MultiIndex.from_tuples([
    ("John", "Smith"),
    ("John", "Doe"),
    ("Jane", "Doe"),
    ("Stephen", "Smith"),
], names=["first_name", "last_name"])

col_index = pd.MultiIndex.from_tuples([
    ("music", "favorite"),
    ("music", "last_seen_live"),
    ("art", "favorite"),
], names=["art_type", "category"])

df = pd.DataFrame([
    ["Swift", "Swift", "Matisse"],
    ["Mozart", "T. Swift", "Van Gogh"],
    ["Beatles", "Wonder", "Warhol"],
    ["Jackson", "Dylan", "Picasso"],
], index=row_index, columns=col_index)
df

art_type                music                      art
category             favorite last_seen_live  favorite
first_name last_name
John       Smith        Swift          Swift   Matisse
           Doe         Mozart       T. Swift  Van Gogh
Jane       Doe        Beatles         Wonder    Warhol
Stephen    Smith      Jackson          Dylan   Picasso

### There's more...

In [151]:
df = pd.DataFrame([[0, 1], [2, 4]], columns=list("ab"))
df

   a  b
0  0  1
1  2  4

In [152]:
# method chaining
(
    df
    .mul(2)
    .add(42)
)

    a   b
0  42  44
1  46  50

In [153]:
# break the chain
df2 = (
    df
    .mul(2)
    .add(42)
)
df2["assigned_c"] = df2["b"] - 3
df2

    a   b  assigned_c
0  42  44          41
1  46  50          47

In [154]:
# continue chaining along with pd.DataFrame.assign
(
    df
    .mul(2)
    .add(42)
    .assign(chained_c=lambda df: df["b"] - 3)
)

    a   b  chained_c
0  42  44         41
1  46  50         47